#pragma once
#include <afxcmn.h>

static const UINT mMaxLine = 3;

class CUnitListCtrl : public CListCtrl
{
public:
	CUnitListCtrl();
	virtual ~CUnitListCtrl();

	/* ------------------------------------------------------------------------------------ */
	/* íËã`                                                                                 */
	/* ------------------------------------------------------------------------------------ */
public:
	enum{ eUnitModel, eUnitType, eUnitSpec };
protected:

	/* ------------------------------------------------------------------------------------ */
	/* ÉÅÉìÉoïœêî                                                                           */
	/* ------------------------------------------------------------------------------------ */
public:
protected:
	CFont	mDrawFont;

	/* ------------------------------------------------------------------------------------ */
	/* ÉÅÉìÉoä÷êî                                                                           */
	/* ------------------------------------------------------------------------------------ */
public:

protected:

	/* ------------------------------------------------------------------------------------ */

public:
	DECLARE_MESSAGE_MAP()
	afx_msg void OnNMCustomdraw(NMHDR* pNMHDR, LRESULT* pResult);
};

